<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<link href="../_system/styles.css" rel="stylesheet" type="text/css">
<title>Playblast</title>
<meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
<meta name="author" content="Timur Hairulin" />
<meta name="description" content="CGRU: CG Tools, Afanasy - Free Open Source Render Farm Manager" />
<meta name="keywords" content="Houdini, Maya, Nuke, RenderMan, Mantra, Mentalray, Max, XSI, SoftImage, prman, Afanasy, animation, rendering, render, farm, manager, free, open source, 3D, 2D" />
</head>
<body>
<table width="99%" align="center">
<tr align="center">
<td width="33%">
<a href="http://sourceforge.net"><img src="../../../../doc/images/sflogo.png" width="88" height="31" border="0" alt="SourceForge.net Logo" /></a>
</td>
<td width="33%">
<p><a href="../../../../index.html" target="_top"><img src="../../../../doc/images/cgru16.png" border="0" alt="CGRU" /></a></p>
</td>
<td width="33%">
<a href="http://cgtalk.ru"><img src="../../../../doc/images/cgtalkru.png" width="88" height="31" border="0" alt="CGTALK.RU Logo" /></a>
</td>
</tr>
</table>

<table width="100%" align="center" cellpadding="0" cellspacing="0">
<tr>
<td width="200px">
<div style="width:100%;height:40px;background:url('../../../../doc/images/header_left.png')" />
</td>
<td>
<div style="width:100%;height:40px;background:url('../../../../doc/images/header.png') repeat-x" />
</td>
<td width="200px">
<div style="width:100%;height:40px;background:url('../../../../doc/images/header_right.png')" />
</td>
</tr>
</table>
<table width="90%" border="0" align="center" cellpadding="0" cellspacing="0"><tr><td>
<!--HEADER-->
<div class="commonText">
<p><strong>Advanced Playblast.</strong></p>
<p>&#1060;&#1048;&#1063;&#1048;:<br>
  - <strong>&#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100; &#1089;&#1082;&#1088;&#1099;&#1090;&#1100; &#1085;&#1077;&#1085;&#1091;&#1078;&#1085;&#1099;&#1077; &#1090;&#1080;&#1087;&#1099; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074;</strong>.&#1050;&#1086;&#1075;&#1076;&#1072; &#1072;&#1085;&#1080;&#1084;&#1080;&#1088;&#1091;&#1077;&#1096;&#1100; &#1076;&#1077;&#1083;&#1072;&#1077;&#1096;&#1100; &#1074;&#1080;&#1076;&#1080;&#1084;&#1099;&#1084;&#1080; &#1083;&#1086;&#1082;&#1072;&#1090;&#1086;&#1088;&#1099;, &#1082;&#1091;&#1088;&#1074;&#1099;, &#1082;&#1083;&#1072;&#1089;&#1090;&#1077;&#1088;&#1099; &#1080; &#1087;&#1088;&#1086;&#1095;&#1080;&#1077; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1099; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103;. &#1040; &#1076;&#1083;&#1103; &#1087;&#1083;&#1077;&#1081;&#1073;&#1083;&#1072;&#1089;&#1090;&#1072; &#1086;&#1085;&#1080; &#1085;&#1077; &#1078;&#1077;&#1083;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;. &#1056;&#1072;&#1085;&#1100;&#1096;&#1077; &#1087;&#1088;&#1080;&#1093;&#1086;&#1076;&#1080;&#1083;&#1086;&#1089;&#1100; &#1087;&#1077;&#1088;&#1077;&#1076; &#1082;&#1072;&#1078;&#1076;&#1099;&#1084; &#1087;&#1083;&#1077;&#1081;&#1073;&#1083;&#1072;&#1089;&#1090;&#1086;&#1084; &#1080;&#1093; &#1087;&#1088;&#1103;&#1090;&#1072;&#1090;&#1100;, &#1072; &#1087;&#1086;&#1089;&#1083;&#1077; &#1086;&#1087;&#1103;&#1090;&#1100; &#1073;&#1099;&#1074;&#1086;&#1076;&#1080;&#1090;&#1100;. Advanced Playblast &#1087;&#1088;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1074;&#1099;&#1073;&#1086;&#1088; &#1082;&#1072;&#1082;&#1080;&#1077; &#1090;&#1080;&#1087;&#1099; &#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; &#1087;&#1088;&#1103;&#1090;&#1072;&#1090;&#1100;, &#1072; &#1087;&#1086;&#1090;&#1086;&#1084; &#1086;&#1087;&#1103;&#1090;&#1100; &#1074;&#1099;&#1074;&#1086;&#1076;&#1080;&#1090;&#1100;.<br>
  - <strong>&#1074;&#1099;&#1074;&#1086;&#1076; &#1085;&#1072; &#1101;&#1082;&#1088;&#1072;&#1085; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1081; &#1080;&#1085;&#1092;&#1099;</strong>. &#1054;&#1095;&#1077;&#1085;&#1100; &#1087;&#1086;&#1083;&#1077;&#1079;&#1085;&#1086; &#1080;&#1084;&#1077;&#1090;&#1100; &#1090;&#1077;&#1082;&#1091;&#1097;&#1080;&#1081; &#1082;&#1072;&#1076;&#1088;. &#1044;&#1083;&#1103; &#1073;&#1086;&#1083;&#1100;&#1096;&#1086;&#1075;&#1086; &#1087;&#1088;&#1086;&#1101;&#1082;&#1090;&#1072; &#1090;&#1072;&#1082;&#1078;&#1077; &#1087;&#1086;&#1083;&#1077;&#1079;&#1085;&#1086; &#1080;&#1084;&#1077;&#1090;&#1100; &#1080;&#1084;&#1103; &#1096;&#1086;&#1090;&#1072;, &#1082;&#1072;&#1084;&#1077;&#1088;&#1099;, &#1102;&#1079;&#1077;&#1088;&#1072; (&#1076;&#1077;&#1083;&#1072;&#1102;&#1097;&#1077;&#1075;&#1086; &#1087;&#1083;&#1077;&#1081;&#1073;&#1083;&#1072;&#1089;&#1090;), &#1074;&#1088;&#1077;&#1084;&#1103; &#1080; &#1090;.&#1087;. &#1080; &#1090;.&#1076;.<br>
  - <strong>&#1079;&#1072;&#1087;&#1086;&#1084;&#1080;&#1085;&#1072;&#1085;&#1080;&#1077; 10 &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1080;&#1093; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1077;&#1082;</strong>. &#1059;&#1076;&#1086;&#1073;&#1085;&#1086; &#1082;&#1086;&#1075;&#1076;&#1072; &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089; &#1087;&#1086;&#1084;&#1085;&#1080;&#1090; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1080;&#1077; 10 &quot;recent file list&quot;, frame range? resolution. &#1048; &#1087;&#1088;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100; &#1073;&#1099;&#1089;&#1090;&#1088;&#1086; &#1084;&#1077;&#1078;&#1076;&#1091; &#1085;&#1080;&#1084;&#1080; &#1087;&#1077;&#1088;&#1077;&#1082;&#1083;&#1102;&#1095;&#1072;&#1090;&#1100;&#1089;&#1103;.<br>
  - <strong>&#1074;&#1099;&#1073;&#1086;&#1088; &#1094;&#1074;&#1077;&#1090;&#1072; &#1092;&#1086;&#1085;&#1072;</strong>.[/B] &#1043;&#1086;&#1088;&#1072;&#1079;&#1076;&#1086; &#1083;&#1091;&#1095;&#1096;&#1077; &#1089;&#1076;&#1077;&#1083;&#1072;&#1090;&#1100; &#1094;&#1074;&#1077;&#1090; &#1087;&#1091;&#1089;&#1090;&#1086;&#1075;&#1086; &#1090;&#1072;&#1082;&#1086;&#1081;, &#1095;&#1090;&#1086; &#1086;&#1085;&#1086; &#1086;&#1073;&#1086;&#1079;&#1085;&#1072;&#1095;&#1072;&#1077;&#1090;, &#1085;&#1077;&#1073;&#1086; - &#1089;&#1080;&#1085;&#1077;&#1077;, &#1074;&#1086;&#1076;&#1072;, &#1079;&#1077;&#1084;&#1083;&#1103; &#1080;. &#1087;. &#1058;&#1072;&#1082; &#1082;&#1088;&#1072;&#1089;&#1080;&#1074;&#1096;&#1077;, &#1072; &#1079;&#1085;&#1072;&#1095;&#1080;&#1090; &#1089;&#1082;&#1086;&#1088;&#1077;&#1077; &#1087;&#1086;&#1085;&#1088;&#1072;&#1074;&#1080;&#1090;&#1089;&#1103; &#1089;&#1091;&#1087;&#1077;&#1088;&#1074;&#1072;&#1081;&#1079;&#1077;&#1088;&#1091; ;)<br>
  - <strong>&#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1077; &#1091;&#1073;&#1080;&#1088;&#1072;&#1085;&#1080;&#1077; Heads Up Display</strong>. &#1042;&#1086; &#1074;&#1088;&#1077;&#1084;&#1103; &#1072;&#1085;&#1080;&#1084;&#1072;&#1094;&#1080;&#1080; &#1073;&#1099;&#1074;&#1072;&#1077;&#1090; &#1091;&#1076;&#1086;&#1074;&#1085;&#1086; &#1074;&#1099;&#1074;&#1086;&#1076;&#1080;&#1090;&#1100; &#1090;&#1091;&#1076;&#1072; &#1085;&#1091;&#1078;&#1085;&#1091;&#1102; &#1080;&#1085;&#1092;&#1091;. &#1040; &#1076;&#1083;&#1103; &#1087;&#1083;&#1077;&#1081;&#1073;&#1083;&#1072;&#1089;&#1090;&#1072;, &#1077;&#1089;&#1083;&#1080; &#1086;&#1085;&#1072; &#1084;&#1077;&#1096;&#1077;&#1083;&#1072;&#1089;&#1100;, &#1087;&#1088;&#1080;&#1093;&#1086;&#1076;&#1080;&#1083;&#1086;&#1089;&#1100; &#1082;&#1072;&#1078;&#1076;&#1099;&#1081; &#1088;&#1072;&#1079; &#1087;&#1088;&#1103;&#1090;&#1072;&#1090;&#1100;, &#1072; &#1087;&#1086;&#1090;&#1086;&#1080;&#1084; &#1086;&#1087;&#1103;&#1090;&#1100; &#1074;&#1099;&#1074;&#1086;&#1076;&#1080;&#1090;&#1100;.<br>
  - <strong>reset camera overscan</strong>. &#1048;&#1085;&#1086;&#1075;&#1076;&#1072; &#1072;&#1085;&#1080;&#1084;&#1072;&#1090;&#1086;&#1088;&#1099; &#1083;&#1102;&#1073;&#1103;&#1090; &#1089;&#1084;&#1086;&#1090;&#1088;&#1077;&#1090;&#1100; &#1095;&#1077;&#1088;&#1077;&#1079; &#1092;&#1080;&#1085;&#1072;&#1083;&#1100;&#1085;&#1091;&#1102; &#1082;&#1072;&#1084;&#1077;&#1088;&#1091;, &#1085;&#1086; &#1089; &#1073;&#1086;&#1083;&#1100;&#1096;&#1080;&#1084; &#1086;&#1074;&#1077;&#1088;&#1089;&#1082;&#1072;&#1085;&#1086;&#1084;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1074;&#1080;&#1076;&#1077;&#1090;&#1100;, &#1095;&#1090;&#1086; &#1084;&#1086;&#1078;&#1077;&#1090; &#1089;&#1082;&#1086;&#1088;&#1086; &#1086;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100;&#1089;&#1103; &#1074; &#1082;&#1072;&#1076;&#1088;&#1077;, &#1072; &#1087;&#1083;&#1077;&#1081;&#1073;&#1083;&#1072;&#1089;&#1090;&#1080;&#1090;&#1100; &#1093;&#1086;&#1090;&#1103;&#1090;, &#1077;&#1089;&#1090;&#1077;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086; &#1073;&#1077;&#1079; &#1085;&#1077;&#1075;&#1086;. &#1053;&#1091; &#1090;&#1086;&#1078;&#1077; &#1095;&#1090;&#1086;&#1073;&#1099; &#1089;&#1072;&#1084;&#1086;&#1084;&#1091; &#1085;&#1077; &#1074;&#1082;&#1083;&#1102;&#1095;&#1072;&#1090;&#1100; - &#1074;&#1099;&#1082;&#1083;&#1102;&#1095;&#1072;&#1090;&#1100;.<br>
</p>
<p><strong>Playblast settings window:</strong></p>
<p><img src="tima_advplayblast.png" width="715" height="536"></p>
<p class="smallComments">&quot;<strong>auto</strong>&quot; column show automatically recognized fields names.</p>
<p class="smallComments">&quot;<strong>custom</strong>&quot; column show final names, which you can manually adjust.</p>
<p class="smallComments">&quot;<strong>more</strong>&quot; column designed to view field info and popup menus.</p>
<p class="smallComments">- sing &quot; <strong>---</strong> &quot; means that the field is used to display user data only and has no influence to playblast command settings. </p>
<p class="smallComments">- sing &quot; <strong>-&gt;&lt;-</strong> &quot; means that the field is used to display data and to configure playblast command. This sing also has a popup menu, where you can select the field value. &quot;<strong>Camera Name</strong>&quot; popup helps you to select scene camera. &quot;<strong>Resolution</strong>&quot;, &quot;<strong>Range</strong>&quot; and &quot;<strong>Movie file</strong>&quot; menus hold last ten settings. </p>
<p align = "right">
<a href="../index.html" target="_top" class="smallComments">jump to CGRU documentation</a>
</p>
</div>
<!--FOOTER-->
</td></tr></table>
<table width="100%" align="center" cellpadding="0" cellspacing="0">
<tr>
<td width="200px">
   <div style="width:100%;height:40px;background:url('../../../../doc/images/footer_left.png')" />
</td>
<td>
   <div style="width:100%;height:40px;background:url('../../../../doc/images/footer.png') repeat-x" />
</td>
<td width="200px">
   <div style="width:100%;height:40px;background:url('../../../../doc/images/footer_center.png')" />
</td>
<td>
   <div style="width:100%;height:40px;background:url('../../../../doc/images/footer.png') repeat-x" />
</td>
<td width="200px">
   <div style="width:100%;height:40px;background:url('../../../../doc/images/footer_right.png')" />
</td>
</tr>
</table>

<table width="99%" align="center">
<tr align="center">
<td width="33%">
<small><i><a href="http://sourceforge.net/projects/cgru/"><img src="../../../../doc/images/sourceforgeproject.png" border="0" alt="SourceForge.net Project" /></a></i></small>
</td>
<td width="33%">
<p><a href="../../../../index.html" target="_top"><img src="../../../../doc/images/cgru16.png" border="0" alt="CGRU" /></a></p>
</td>
<td width="33%">
<small><i><a href="http://www.cgtalk.ru/forum/forumdisplay.php?f=168"><img src="../../../../doc/images/cgtalkforum.png" border="0" alt="cgtalkforum" /></a></i></small>
</td>
</tr>
</table>
</body>
</html>
