<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<link href="../_system/styles.css" rel="stylesheet" type="text/css">
<title>Slot Edges</title>
<meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
<meta name="description" content="CGRU: CG Tools, CG Rules, Afanasy - Free Open Source Render Farm Manager" />
<meta name="keywords" content="Houdini, Maya, Nuke, RenderMan, Mantra, Mentalray, Max, XSI, SoftImage, prman, Afanasy, animation, rendering, render, farm, manager, free, open source, 3D, 2D" />
</head>
<body>
<table width="99%" align="center">
<tr align="center">
<td width="33%">
<a href="http://sourceforge.net/projects/cgru"><img src="../../../../doc/images/sflogo.png" width="88" height="31" border="0" alt="SourceForge.net Logo" /></a>
</td>
<td width="33%">
<p><a href="../../../../index.html" target="_top"><img src="../../../../doc/images/cgru16.png" border="0" alt="CGRU" /></a></p>
</td>
<td width="33%">
<a href="http://www.linkedin.com/groups/CGRU-AFANASY-4263049"><img src="../../../../doc/images/linkedin.png" border="0" alt="LinkedIn" /></a>
</td>
</tr>
</table>

<table width="100%" align="center" cellpadding="0" cellspacing="0">
<tr>
<td width="200px">
<div style="width:100%;height:40px;background:url('../../../../doc/images/header_left.png')" />
</td>
<td>
<div style="width:100%;height:40px;background:url('../../../../doc/images/header.png') repeat-x" />
</td>
<td width="200px">
<div style="width:100%;height:40px;background:url('../../../../doc/images/header_right.png')" />
</td>
</tr>
</table>
<table width="90%" border="0" align="center" cellpadding="0" cellspacing="0"><tr><td>
<!--HEADER-->
<div class="commonText">
<p><strong>&#1056;&#1077;&#1079;&#1072;&#1083;&#1082;&#1072; &#1088;&#1077;&#1073;&#1077;&#1088; (&#1085;&#1086;&#1076;&#1086;&#1081;). </strong></p>
<p>&#1056;&#1077;&#1078;&#1077;&#1090; &#1074;&#1099;&#1076;&#1077;&#1083;&#1077;&#1085;&#1085;&#1099;&#1077; &#1088;&#1077;&#1073;&#1088;&#1072; (&#1076;&#1077;&#1083;&#1072;&#1077;&#1090; &#1097;&#1077;&#1083;&#1100;). </p>
<p><img src="tima_polyslot.png" width="629" height="331"></p>
<p>It is a standart deformer node, witch  offsets control points of deformable objects by Ken Perlin noise algorithm.</p>
<p> &#1040;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090; useMesh &#1085;&#1072; &#1085;&#1086;&#1076;&#1077; &#1075;&#1086;&#1074;&#1086;&#1088;&#1080;&#1090; &#1085;&#1086;&#1076;&#1077; &#1082;&#1072;&#1082;&#1086;&#1081; &#1084;&#1077;&#1096; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; - &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1077;&#1081; &#1087;&#1086;&#1076;&#1072;&#1105;&#1090;&#1089;&#1103; &#1085;&#1072; &#1074;&#1093;&#1086;&#1076;, &#1080;&#1083;&#1080; &#1079;&#1072;&#1082;&#1077;&#1096;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1081; &#1080; &#1091;&#1078;&#1077; &#1088;&#1072;&#1079;&#1088;&#1077;&#1079;&#1072;&#1085;&#1085;&#1099;&#1081;. &#1069;&#1090;&#1086; &#1085;&#1091;&#1078;&#1085;&#1086; &#1076;&#1083;&#1103; &#1073;&#1086;&#1083;&#1077;&#1077; &#1073;&#1099;&#1089;&#1090;&#1088;&#1086;&#1081; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1085;&#1086;&#1076;&#1099;. &#1044;&#1077;&#1083;&#1086; &#1074; &#1090;&#1086;&#1084;, &#1095;&#1090;&#1086; &#1085;&#1086;&#1076;&#1072; &#1089;&#1085;&#1072;&#1073;&#1078;&#1077;&#1085;&#1072; &#1084;&#1072;&#1085;&#1080;&#1087;&#1091;&#1083;&#1103;&#1090;&#1086;&#1088;&#1086;&#1084;. &#1042;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086; &#1085;&#1091;&#1078;&#1085;&#1086; &#1085;&#1086;&#1074;&#1099;&#1077; &#1074;&#1077;&#1088;&#1090;&#1077;&#1082;&#1089;&#1099; &#1085;&#1077;&#1084;&#1085;&#1086;&#1075;&#1086; &#1088;&#1072;&#1079;&#1076;&#1074;&#1080;&#1085;&#1091;&#1090;&#1100;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1080;&#1093; &#1073;&#1099;&#1083;&#1086; &#1083;&#1077;&#1075;&#1095;&#1077; &#1074;&#1099;&#1076;&#1077;&#1083;&#1103;&#1090;&#1100;. &#1058;&#1086;&#1075;&#1076;&#1072; &#1074;&#1099; &#1085;&#1072;&#1078;&#1080;&#1084;&#1072;&#1077;&#1090;&#1077; &#1082;&#1085;&#1086;&#1087;&#1086;&#1095;&#1082;&#1091; &quot;t&quot; (Show Manipulator Tool) &#1080; &#1080;&#1085;&#1090;&#1077;&#1088;&#1072;&#1082;&#1090;&#1080;&#1074;&#1085;&#1086; &#1088;&#1072;&#1079;&#1076;&#1074;&#1080;&#1075;&#1072;&#1077;&#1090;&#1077; &#1074;&#1077;&#1088;&#1090;&#1077;&#1082;&#1089;&#1099; &#1084;&#1072;&#1085;&#1080;&#1087;&#1091;&#1083;&#1103;&#1090;&#1086;&#1088;&#1086;&#1084;. &#1042; &#1101;&#1090;&#1086; &#1074;&#1088;&#1077;&#1084;&#1103;, &#1077;&#1089;&#1083;&#1080; &#1085;&#1072; &#1085;&#1086;&#1076;&#1077; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090; &quot;useMesh&quot; &#1088;&#1072;&#1074;&#1077;&#1085; &quot;cashed&quot; &#1086;&#1085;&#1072; &#1088;&#1077;&#1073;&#1088;&#1072; &#1079;&#1072;&#1085;&#1086;&#1074;&#1086; &#1085;&#1077; &#1088;&#1077;&#1078;&#1077;&#1090; (&#1079;&#1072;&#1095;&#1077;&#1084; - &#1086;&#1085;&#1080; &#1091;&#1078;&#1077; &#1088;&#1072;&#1079;&#1088;&#1077;&#1079;&#1072;&#1085;&#1085;&#1099;) &#1072; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086; &#1076;&#1074;&#1080;&#1075;&#1072;&#1077;&#1090; &#1074;&#1077;&#1088;&#1090;&#1077;&#1082;&#1089;&#1099; &#1091; &#1082;&#1101;&#1096;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086; &#1084;&#1077;&#1096;&#1072;. &#1063;&#1090;&#1086; &#1087;&#1088;&#1086;&#1080;&#1089;&#1093;&#1086;&#1076;&#1080;&#1090; &#1089; &#1084;&#1086;&#1083;&#1085;&#1080;&#1077;&#1085;&#1086;&#1089;&#1085;&#1086;&#1081; &#1089;&#1082;&#1086;&#1088;&#1086;&#1089;&#1090;&#1100;&#1102;. &#1053;&#1086;, &#1077;&#1089;&#1083;&#1080; &#1080;&#1079;&#1084;&#1077;&#1085;&#1080;&#1090;&#1089;&#1103; &#1074;&#1093;&#1086;&#1076;&#1085;&#1086;&#1081; &#1084;&#1077;&#1096; (&#1080;&#1089;&#1090;&#1086;&#1088;&#1080;&#1103;), &#1085;&#1086;&#1076;&#1072; &#1085;&#1077; &#1086;&#1073;&#1088;&#1072;&#1090;&#1080;&#1090; &#1085;&#1072; &#1101;&#1090;&#1086; &#1085;&#1080;&#1082;&#1072;&#1082;&#1086;&#1075;&#1086; &#1074;&#1085;&#1080;&#1084;&#1072;&#1085;&#1080;&#1103;. <br>
&#1045;&#1089;&#1083;&#1080; &#1074;&#1099; &#1084;&#1077;&#1085;&#1103;&#1077;&#1090;&#1077; &#1080;&#1089;&#1090;&#1086;&#1088;&#1080;&#1102; &#1080; &#1093;&#1086;&#1090;&#1080;&#1090;&#1077;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1088;&#1077;&#1078;&#1072;&#1102;&#1097;&#1072;&#1103; &#1085;&#1086;&#1076;&#1072; &#1074;&#1089;&#1105; &#1086;&#1090;&#1088;&#1072;&#1073;&#1072;&#1090;&#1099;&#1074;&#1072;&#1083;&#1072;, &#1085;&#1072;&#1076;&#1086; &#1087;&#1086;&#1089;&#1090;&#1072;&#1074;&#1080;&#1090;&#1100; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090; &quot;useMesh&quot; &#1088;&#1072;&#1074;&#1077;&#1085;&#1099;&#1084; &quot;recompute&quot;. &#1058;&#1086;&#1075;&#1076;&#1072; &#1085;&#1086;&#1076;&#1072; &#1073;&#1091;&#1076;&#1077;&#1090; &quot;&#1089;&#1084;&#1086;&#1090;&#1088;&#1077;&#1090;&#1100;&quot; &#1085;&#1072; &#1074;&#1093;&#1086;&#1076;&#1085;&#1086;&#1081; &#1084;&#1077;&#1096;. &#1053;&#1086;, &#1077;&#1089;&#1083;&#1080; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103; &#1074; &#1080;&#1089;&#1090;&#1086;&#1088;&#1080;&#1080; &#1087;&#1086;&#1074;&#1083;&#1077;&#1082;&#1091;&#1090; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103; &#1074; &#1090;&#1086;&#1087;&#1086;&#1083;&#1086;&#1075;&#1080;&#1080; &#1084;&#1077;&#1096;&#1072;, &#1090;&#1086; &#1085;&#1086;&#1076;&#1072; &#1085;&#1077; &#1086;&#1090;&#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1077;&#1090; &#1082;&#1086;&#1088;&#1088;&#1077;&#1082;&#1090;&#1085;&#1086; (&#1082;&#1072;&#1082; &#1080; &#1074; &#1076;&#1088;&#1091;&#1075;&#1080;&#1077; &#1084;&#1072;&#1081;&#1089;&#1082;&#1080;&#1077; &#1085;&#1086;&#1076;&#1099;). </p>
<p align = "right">
<a href="../index.html" target="_top" class="smallComments">jump to CGRU documentation</a>
</p>
</div>
<!--FOOTER-->
</td></tr></table>
<table width="100%" align="center" cellpadding="0" cellspacing="0">
<tr>
<td width="200px">
   <div style="width:100%;height:40px;background:url('../../../../doc/images/footer_left.png')" />
</td>
<td>
   <div style="width:100%;height:40px;background:url('../../../../doc/images/footer.png') repeat-x" />
</td>
<td width="200px">
   <div style="width:100%;height:40px;background:url('../../../../doc/images/footer_center.png')" />
</td>
<td>
   <div style="width:100%;height:40px;background:url('../../../../doc/images/footer.png') repeat-x" />
</td>
<td width="200px">
   <div style="width:100%;height:40px;background:url('../../../../doc/images/footer_right.png')" />
</td>
</tr>
</table>

<table width="99%" align="center">
<tr align="center">
<td width="33%">
<a href="https://github.com/CGRU/cgru"><img src="../../../../doc/images/github.png" border="0" alt="SourceForge.net Project" /></a>
</td>
<td width="33%">
<p><a href="../../../../index.html" target="_top"><img src="../../../../doc/images/cgru16.png" border="0" alt="CGRU" /></a></p>
</td>
<td width="33%">
<a href="http://libregraphicsworld.org/tag/cgru"><img src="../../../../doc/images/lgw.png" border="0" alt="Libre Graphics World" /></a>
</td>
</tr>
</table>
</body>
</html>
